test/request-response-samples/GetNodes__complex_self_referencing/request.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
<soap:Header/>
<soap:Body>
		<ns1:GetNodes xmlns:ns1="http://tempuri.org/"/>
</soap:Body>
</soap:Envelope>